Learning every steps of EDA through survival prediction from the "Titanic dataset"

# **1. Importing Required Libraries**

In [135]:
import numpy as np      # Numeric calculations
import pandas as pd     # Handle tabular data like 'CSV' files
import matplotlib.pyplot as plt  # data visualization
import seaborn as sns   # data visualization

# **2. READING DATASETS(This loads your datasets into Pandas DataFrames)**

In [136]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

# 3. Data Inspection.WHY? It Helps you understand.

What features exist.

How many rows and columns.

What the first few entries look like.

Gender distribution

**Tools : train.head(), train.shape, train.columns, train['Sex'].value_counts()**

**1. Viewing data and different features with .head()**

In [137]:
train.head()  # Display the first few rows of the training dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [138]:
test.head()  # Display the first few rows of the testing dataset

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

**2. shape returns a tuple showing the dimensions of the data**

In [139]:
train.shape

(891, 12)

In [140]:
test.shape

(418, 11)

**3. columns returns the labels(names) of all the columns in a DataFrame**

In [141]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [142]:
test.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

**4. It counts how many times each unique value appears in the "NAME" column**

In [143]:
train['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

# **4. Data Visualization**

In [ ]:
#Visualizing survivals based on gender
train['Died'] = 1 - train['survived']  # Create a new column 'Died' where 1 indicates death and 0 indicates survival